In [68]:
import numpy as np
import pandas as pd 
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.ensemble import RandomForestRegressor

In [96]:
import pickle
import warnings
warnings.filterwarnings("ignore")

In [115]:
df = pd.read_csv("traffic.csv")

In [116]:
df.head()

              DateTime  Junction  Vehicles           ID
0  2015-11-01 00:00:00         1        15  20151101001
1  2015-11-01 01:00:00         1        13  20151101011
2  2015-11-01 02:00:00         1        10  20151101021
3  2015-11-01 03:00:00         1         7  20151101031
4  2015-11-01 04:00:00         1         9  20151101041

In [117]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48120 entries, 0 to 48119
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  48120 non-null  object
 1   Junction  48120 non-null  int64
 2   Vehicles  48120 non-null  int64
 3   ID        48120 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [118]:
df.describe()

           Junction      Vehicles            ID
count  48120.000000  48120.000000  4.812000e+04
mean       2.180549     22.791334  2.016330e+10
std        0.966955     20.750063  5.944854e+06
min        1.000000      1.000000  2.015110e+10
25%        1.000000      9.000000  2.016042e+10
50%        2.000000     15.000000  2.016093e+10
75%        3.000000     29.000000  2.017023e+10
max        4.000000    180.000000  2.017063e+10

In [119]:
df.drop('ID', axis=1, inplace=True)

In [120]:
type(df.DateTime[0])

str

In [121]:
df['DateTime'] = pd.to_datetime(df['DateTime'])

In [122]:
type(df.DateTime[0])

pandas._libs.tslibs.timestamps.Timestamp

In [123]:
df['Month'] = df['DateTime'].dt.month
df['Hour'] = df['DateTime'].dt.hour
df['Date_no'] = df['DateTime'].dt.day
df['Day'] = df.DateTime.dt.strftime("%A")

In [124]:
df.head()

             DateTime  Junction  Vehicles  Month  Hour  Date_no     Day
0 2015-11-01 00:00:00         1        15     11     0        1  Sunday
1 2015-11-01 01:00:00         1        13     11     1        1  Sunday
2 2015-11-01 02:00:00         1        10     11     2        1  Sunday
3 2015-11-01 03:00:00         1         7     11     3        1  Sunday
4 2015-11-01 04:00:00         1         9     11     4        1  Sunday

In [125]:
df.drop("DateTime", axis = 1, inplace=True)

In [126]:
df.head()

   Junction  Vehicles  Month  Hour  Date_no     Day
0         1        15     11     0        1  Sunday
1         1        13     11     1        1  Sunday
2         1        10     11     2        1  Sunday
3         1         7     11     3        1  Sunday
4         1         9     11     4        1  Sunday

In [127]:
x = pd.get_dummies(df.Day)

In [128]:
x.head()

   Friday  Monday  Saturday  Sunday  Thursday  Tuesday  Wednesday
0       0       0         0       1         0        0          0
1       0       0         0       1         0        0          0
2       0       0         0       1         0        0          0
3       0       0         0       1         0        0          0
4       0       0         0       1         0        0          0

In [129]:
df = pd.concat([df,x], axis="columns")

In [130]:
df.head()

,Junction,Vehicles,Month,Hour,Date_no,Day,Friday,Monday,Saturday,Sunday,Thursday,Tuesday,Wednesday
0,1,15,11,0,1,Sunday,0,0,0,1,0,0,0
1,1,13,11,1,1,Sunday,0,0,0,1,0,0,0
2,1,10,11,2,1,Sunday,0,0,0,1,0,0,0
3,1,7,11,3,1,Sunday,0,0,0,1,0,0,0
4,1,9,11,4,1,Sunday,0,0,0,1,0,0,0

In [131]:
df.drop(["Day", "Sunday"], axis="columns", inplace=True)

In [132]:
df.head()

,Junction,Vehicles,Month,Hour,Date_no,Friday,Monday,Saturday,Thursday,Tuesday,Wednesday
0,1,15,11,0,1,0,0,0,0,0,0
1,1,13,11,1,1,0,0,0,0,0,0
2,1,10,11,2,1,0,0,0,0,0,0
3,1,7,11,3,1,0,0,0,0,0,0
4,1,9,11,4,1,0,0,0,0,0,0

In [135]:
df.shape

(48120, 11)

In [138]:
y = df.Vehicles
X = df.drop("Vehicles", axis=1)

In [142]:
X_train, X_test, Y_train, Y_test = train_test_split(X,y,test_size=0.2)

In [152]:
m = RandomForestRegressor()

In [153]:
m.fit(X_train, Y_train)

RandomForestRegressor()

In [154]:
m.score(X_test, Y_test)

0.8859090859071181

In [157]:
with open("saved_model","wb") as file:
    pickle.dump(m,file)
    
#with open("model_pickle","rb") as file:
#   mod = pickle.load(file)